<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
<title>Haftungsausschluss</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<link rel="stylesheet" href="../css/default.css" type="text/css" />
</head>

<body>
<div class="navbar">

<a class="navin" title="Zur Startseite gehen." href="../index.html">www.gailer-net.de</a>&nbsp;

<img src="../images/arrow.gif" width="22" height="10" alt="arrow" />&nbsp;

&nbsp;Haftungsausschluss

</div>

<div class="head">
<h1>Haftungsausschluss</h1>
</div>

<div class="left">
<h3>Haftung f&uuml;r Inhalte</h3>

<ul>
<li>Der Inhaber dieser Website, Heinrich Gailer, bietet auf seiner Website nach bestem Wissen nur richtige und aktuelle Informationen an.</li>

<li>Er &uuml;bernimmt jedoch keinerlei Verantwortung oder Gew&auml;hrleistung hinsichtlich der Aktualit&auml;t und Richtigkeit und lehnt jegliche diesbez&uuml;gliche Verpflichtung ausdr&uuml;cklich ab.
</li>

<li>Der Inhaber der Website Heinrich Gailer bem&uuml;ht sich m&ouml;glichst genaue und zuverl&auml;ssige Informationen auf seinen Webseiten zu ver&ouml;ffentlichen.</li>

<li>Er kann jedoch keinerlei Gew&auml;hr f&uuml;r die Richtigkeit aller ver&ouml;ffentlichten Informationen leisten. Jegliche Haftung f&uuml;r den Fall von Irrt&uuml;mern oder Auslassungen auf den Webseiten von www.gailer-net.de wird ausgeschlossen.</li>

<li>Alle externen Seiten wurden vor dem Setzen eines Verweises (Links) inhaltlich sorgf&auml;ltig gepr&uuml;ft.</li>
</ul>
</div>

<div class="right">

<h3>Haftung f&uuml;r Links</h3>

<ul>
<li>Trotz dieser sorgf&auml;ltigen Pr&uuml;fung betont der Inhaber der Website, Heinrich Gailer, ausdr&uuml;cklich, dass er keinerlei Einfluss auf die aktuelle oder zuk&uuml;nftige Gestaltung dieser Webseiten hat.</li>


<li>Ebensowenig hat er Einfluss auf den Inhalt der gelinkten Seiten und eventuelle Verletzungen geltender Rechte, das schlie&szlig;t auch Marken- oder Titelrechte mit ein.</li>

<li>F&uuml;r die Inhalte der verlinkten Seiten ist ausschlie&szlig;lich der jeweilige Anbieter der gelinkten Seite verantwortlich.</li>

<li>Bei Bekanntwerden von Rechtsverletzungen werden diese Links umgehend entfernt. Sollten Sie &uuml;ber einen Link von www.gailer-net.de auf eine Seite mit rechtswidrigen oder anst&ouml;&szlig;igen Inhalten gelangen, informieren Sie bitte <a  href="mailto:heinrich@gailer-net.de?subject=Link melden:">heinrich@gailer-net.de</a>.</li>

<li>Beachten Sie bitte auch die <a href="legalnotice.html">rechtlichen Hinweise</a>.</li>
</div>

<div class="clearfloats">&nbsp;</div>


<p>Zur&uuml;ck zur <a href="../index.html">Startseite</a>.</p>

<table id="footer">
<tr>
 <td><a href="http://validator.w3.org/check/referer"><img class="jigsaw" src="../images/valid-xhtml10.gif" alt="G&uuml;ltiges XHTML 1.0!" /></a>&nbsp;<a href="http://jigsaw.w3.org/css-validator/validator?uri=http://www.gailer-net.de/css/default.css"><img class="jigsaw" src="../images/vcss.gif" alt="G&uuml;ltiges CSS!" /></a></td>
 <td>&nbsp;</td>
</tr>
</table>
</body>
</html>