<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
<title>Copyright</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<link rel="stylesheet" href="../css/default.css" type="text/css" />
<style type="text/css">
<!--
li{
 margin-top:1em;
}
-->
</style>
</head>

<body>
<div class="navbar">

<a class="navin" title="Zur Startseite gehen." href="../index.html">www.gailer-net.de</a>&nbsp;

<img src="../images/arrow.gif" width="22" height="10" alt="arrow" />&nbsp;

&nbsp;Copyright

</div>

<div class="head">
<h1>Urheberrecht &amp; Copyright</h1>
</div>

<div class="left">

<ul>
<li>Die Ver&ouml;ffentlichungen auf diesen Seiten unterliegen dem deutschen Urheberrecht. Sofern nicht besonders erw&auml;hnt, sind alle Seiten urheberrechtlich gesch&uuml;tzt.</li>

<li>Alle Rechte vorbehalten einschlie&szlig;lich der Vervielf&auml;ltigung, &Uuml;bersetzung, Mikroverfilmung sowie Einspeicherung und Verarbeitung in elektronischen Systemen. Die Ver&ouml;ffentlichung der Inhalte oder Teilen davon bedarf der ausdr&uuml;cklichen  Genehmigung von Heinrich Gailer.</li>

<li>
Das Copyright der englischen Seiten des Java Tutorials liegt bei Bradley Kjell, kjell at ieee dot org, Central Connecticut State University. Das Urheberrecht der deutschen &Uuml;bersetzung und der dem Tutorial hinzugef&uuml;gten Seiten liegt bei Heinrich Gailer, heinrich at gailer-net dot de.</li>

<li>Die &Uuml;bersetzungen d&uuml;rfen zu privaten Zwecken und zu Lehrzwecken an Schulen und Universit&auml;ten, in angemessener Form (siehe dazu den n&auml;chsten Punkt), verwendet werden.</li>
</ul>
</div>

<div class="right">
<ul>
<li>Gedruckte Versionen sind f&uuml;r den privaten, schulischen oder universit&auml;ren Gebrauch  erlaubt, sofern der Hinweis auf das Copyright bestehen bleibt. Der &Uuml;bersetzer freut sich &uuml;ber eine Mail, falls die &Uuml;bersetzungen in diesem Sinne verwendet werden.</li>


<li>Downloads und Kopien dieser Seiten sind nur f&uuml;r den privaten, nicht kommerziellen Gebrauch gestattet. Die kommerzielle Verwendung bzw. der kommerzielle Abdruck der &Uuml;bersetzungen ist nicht erlaubt.</li>


<li>Es ist nur mit der <strong>ausdr&uuml;cklichen Erlaubnis von Heinrich Gailer erlaubt</strong>, eine Kopie dieses Tutorials auf einem Internet Server zur Verf&uuml;gung zu stellen.</li>

<li>E-Mail: <a href="mailto:heinrich@gailer-net.de?subject=Java Tutorial: Rechtliches">heinrich@gailer-net.de</a></li>

<li>Beachten Sie bitte auch den <a href="disclaimer.html">Haftungsausschluss</a>.</li>
</ul>
</div>

<div class="clearfloats">&nbsp;</div>

<p>Zur&uuml;ck zur <a href="../index.html">Startseite</a>.</p>


<table id="footer">
<tr>
 <td><a href="http://validator.w3.org/check/referer"><img class="jigsaw" src="../images/valid-xhtml10.gif" alt="G&uuml;ltiges XHTML 1.0!" /></a>&nbsp;<a href="http://jigsaw.w3.org/css-validator/validator?uri=http://www.gailer-net.de/css/default.css"><img class="jigsaw" src="../images/vcss.gif" alt="G&uuml;ltiges CSS!" /></a></td>
 <td>&nbsp;</td>
</tr>
</table>
</body>
</html>