<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
<title>Rechtliche Hinweise</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<link rel="stylesheet" href="../css/default.css" type="text/css" />
</head>

<body>
<div class="navbar">

<a class="navin" title="Zur Startseite gehen." href="../index.html">www.gailer-net.de</a>&nbsp;

<img src="../images/arrow.gif" width="22" height="10" alt="arrow" />&nbsp;

&nbsp;Rechtliche Hinweise
</div>

<div class="head">
<h1>Rechtliche Hinweise</h1>
</div>

<div>

<ul>
<li>Die Ver&ouml;ffentlichungen auf diesen Seiten unterliegen dem deutschen Urheberrecht. Sofern nicht besonders erw&auml;hnt, sind alle Seiten urheberrechtlich gesch&uuml;tzt.</li>

<li>Beitr&auml;ge Dritter sind als solche gekennzeichnet. Vervielf&auml;ltigung, Bearbeitung und jede Art der Verwertung au&szlig;erhalb der Grenzen des Urheberrechtes bed&uuml;rfen der Zustimmung von Heinrich Gailer oder des jeweiligen Verfassers.</li>

<li>Downloads und Kopien dieser Seiten sind nur f&uuml;r den privaten, nicht kommerziellen Gebrauch gestattet.</li>

<li>
Das Urheberrecht der englischen Seiten des Java Tutorials liegt bei Bradley Kjell, Central Connecticut State University.</li>

<li>Das Urheberrecht der deutschen &Uuml;bersetzung und der dem Tutorial hinzugef&uuml;gten Seiten liegt bei Heinrich Gailer.</li>

<li>Die &Uuml;bersetzungen d&uuml;rfen zu privaten Zwecken und zu Lehrzwecken an Schulen und Universit&auml;ten in angemessener Form verwendet werden.</li>

<li>Gedruckte Versionen sind f&uuml;r den privaten, schulischen oder universit&auml;ren Gebrauch  erlaubt, sofern der Hinweis auf das Copyright bestehen bleibt. Der &Uuml;bersetzer freut sich &uuml;ber eine Mail, falls die &Uuml;bersetzungen in diesem Sinne verwendet werden.</li>

<li>Die kommerzielle Verwendung, bzw. der kommerzielle Abdruck der &Uuml;bersetzungen ist nicht erlaubt.</li>

<li><strong>Es ist ausdr&uuml;cklich nicht erlaubt</strong>, eine Kopie dieses Tutorials auf einem Internet Server zur Verf&uuml;gung zu stellen. Denn es gibt keinen Grund eine Kopie, die immer veraltet sein wird, einem Link zur aktuellen Version vorzuziehen.</li>

<li>E-Mail: <a href="mailto:heinrich@gailer-net.de?subject=Java Tutorial: Rechtliches">heinrich@gailer-net.de</a></li>

<li>Beachten Sie bitte auch den <a href="disclaimer.html">Haftungsausschluss</a>.</li>

</ul>
<p>Zur&uuml;ck zur <a href="../index.html">Startseite</a>.</p>
</div>
<table id="footer">
<tr>
 <td><a href="http://validator.w3.org/check/referer"><img class="jigsaw" src="../images/valid-xhtml10.gif" alt="G&uuml;ltiges XHTML 1.0!" /></a>&nbsp;<a href="http://jigsaw.w3.org/css-validator/validator?uri=http://www.gailer-net.de/css/default.css"><img class="jigsaw" src="../images/vcss.gif" alt="G&uuml;ltiges CSS!" /></a></td>
 <td>&nbsp;</td>
</tr>
</table>
</body>
</html>