<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2000,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>IO-Str&ouml;me</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap10.frames on Wed Jun 25 17:19:36 CEST 2008 -->

<!-- ANSWER AREA -->
<p>
F&uuml;hrt der Computer Ihres Autos Input und Output durch?
</p>

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
Ja &#8212; Daten kommen als Input von den Sensoren, Berechnungen werden durchgef&uuml;hrt
und die Ergebnisse werden auf den Kontrolleinheiten ausgegeben.
</p>


</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>IO-Str&ouml;me</h1>
<A NAME="input stream"></A>
<A NAME="output stream"></A>
<A NAME="stream, i/o"></A>
<p>
Wenn das Computerprogramm des Autos in Java geschrieben w&auml;re,
w&uuml;rde es spezialisierte IO-Pakete verwenden,
die die Sensoren und Kontrolleinheiten regeln.
Es w&uuml;rde nicht das IO-Paket verwenden, das mit Tastatur und Terminals zu tun hat.
</p>

<p>
In Java werden Eingabedaten als <b>Eingabestrom</b> und Ausgabedaten als <b>Ausgabestrom</b> bezeichnet. Stellen Sie sich diese Str&ouml;me folgenderma&szlig;en vor:
</p>

<center>
<img src="IOStreams.gif" vspace="10" hspace="10" />
</center>
<p>
In dieser Abbildung wird unterstellt, dass jedes &quot;O&quot; ein Datenst&uuml;ck ist,
das in der Reihe darauf wartet Input zu sein oder als Output rauszugehen.
Daten einzugeben wird &uuml;blicherweise Daten <em>lesen</em> genannt;
und Daten auszugeben wird &uuml;blicherweise Daten <em>schreiben</em> genannt
(oder Daten <em>ausgeben</em>, wenn der Ausgabestrom mit dem Bildschirm oder
einem Drucker verkn&uuml;pft ist).
</p>

<p>
Sie k&ouml;nnten sich den Eingabestrom als eine Kette von Perlen vorstellen,
die das Programm der Reihe nach eine nach der anderen einliest. Der Ausgabestrom ist eine Kette von neuen Perlen (&uuml;blicherweise nicht dieselben, die hereinkamen).
Oft wird ein  Programm mehrere Daten in Reihe einlesen m&uuml;ssen, bevor es
genug zum Verarbeiten hat. Zum Beispiel k&ouml;nnten die Eingabedaten eine Liste von Zahlen sein.
Die Ausgabedaten k&ouml;nnten ihre Summe sein.
</p>

<p>
Im allgemeinen k&ouml;nnte ein Programm mehrere Eingabestr&ouml;me haben, die in es hineinflie&szlig;en, und mehrere Ausgabestr&ouml;me haben, die aus ihm herausflie&szlig;en.
F&uuml;r die meisten Programme in diesen Aufzeichnungen gibt es drei IO-Str&ouml;me:
</p>

<ul>
<li><code>System.in</code> &#8212; der Eingabestrom.</li>
<li><code>System.out</code> &#8212; der Ausgabestrom f&uuml;r die normalen Ergebnisse.</li>
<li><code>System.err</code> &#8212; der Ausgabestrom f&uuml;r Fehlermeldungen.</li>
</ul>

<p>
Normalerweise ist <code>System.in</code> mit der Tastatur verbunden
und die Daten sind Character.
Sowohl <code>System.out</code> als auch <code>System.err</code> sind mit dem
Bildschirm verbunden und beide bestehen aus Character-Daten.
Diese Str&ouml;me sind f&uuml;r sich gesehen schwierig zu handhaben.
Wir werden als Hilfe das Paket <code>java.io</code> verwenden.
</p>


</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 3:</h3>
<a href="ch10_4.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
Was sendet die Tastatur an Ihr Programm, wenn Sie das Folgende eintippen:
</p>

<blockquote>
<pre>
1234
</pre>
</blockquote>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#10">Inhaltsverzeichnis</a>
</div>

</body>
</html>
