<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2000,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Keine eingebaute IO</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap10.frames on Wed Jun 25 17:19:36 CEST 2008 -->

<!-- ANSWER AREA -->
<p>
Wenn ein Computerprogramm eine <em>Input</em>-Operation durchf&uuml;hrt,
in welche Richtung flie&szlig;en die Daten?</p>

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
Von einem &auml;u&szlig;eren Ger&auml;t <em>in</em> das Programm.
</p>


</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Keine eingebaute IO</h1>
<p>
Input und Output sind so gebr&auml;uchlich,
dass es daf&uuml;r eine Abk&uuml;rzung gibt: <em>IO</em>.
IO-Operationen sind sehr kompliziert, sowohl auf der Software-Ebene
als auch auf der elektronischen Ebene.
Ein Teil des Problems besteht darin, dass die Art in der
Daten <b>au&szlig;erhalb</b> des Computers organisiert sind sich von der
Art unterscheidet, in der sie <b>innerhalb</b> des
Computers organisiert sind.
</p>

<A NAME="package"></A>
<p>
Es gibt in Java keine Standardanweisungen f&uuml;r Input- und Output-Operationen.
Der gesamte Input und Output wird durchgef&uuml;hrt, indem Methoden verwendet werden,
die Teil eines Pakets sind.
Ein Paket ist eine Sammlung von Klassen, die von anderen Programmen verwendet werden k&ouml;nnen. F&uuml;r jetzt, betrachten Sie ein Paket als eine Werkzeugkiste und die sich darin befindlichen Klassen als Werkzeuge.
Es gibt mehrere IO-Pakete. Gew&ouml;hnlich w&auml;hlt sich der Programmierer dasjenige aus,
das die Klassen f&uuml;r die zu erledigende Arbeit enth&auml;lt. Diese Aufzeichnungen verwenden das <code><strong>java.io</strong></code> Paket, welches das am meisten verwendete IO-Paket ist.
</p>

<p>
Es mag Ihnen seltsam vorkommen, dass Java selbst keine eingebaute IO hat. Der Grund daf&uuml;r ist, dass es sehr viele Arten von IO gibt und, dass eine Sprache, die alle eingebaut h&auml;tte, zu umfangreich und schwerf&auml;llig w&auml;re. Eine professionelle Sprache, so wie Java (C, C++ u.a.) erlaubt es dem Programmierer sich das richtige IO-Paket f&uuml;r den Job auszuw&auml;hlen.
</p>

<p>
<b>Hinweis: </b> Wie bereits erw&auml;hnt, einige B&uuml;cher verwenden
ihre eigenen auf <code><b>java.io</b></code> basierenden IO-Pakete.
Diese Methoden werden sich von den hier beschrieben etwas unterscheiden,
aber das Konzept ist das gleiche.
</p>


</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 2:</h3>
<a href="ch10_3.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
Wenn Sie ein neues Modell eines Automobils haben, verf&uuml;gt es &uuml;ber einen Computer, der die verschiedenen Aspekte des Motors steuert, w&auml;hrend er die Daten von zahlreichen Sensoren &uuml;berwacht. F&uuml;hrt dieser Computer Input und Output durch?
</p>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#10">Inhaltsverzeichnis</a>
</div>

</body>
</html>
