<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd" >
<html>
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="author" content="kjell at ieee dot org">
<meta name="copyright" content="2008">
<meta name="germantranslation" content="Heinrich Gailer, heinrich at gailer-net dot de">
<meta name="germancopyright" content="2010, Heinrich Gailer">
<meta name="robots" content="index,follow">
<title>Hardware und Software</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css">
</head>

<body>
<!-- generated by CSSmaker.java, version 04/06/2010 on Thu Dec 27 15:32:02 CET 2012 -->

<!-- ANSWER DIVISION -->

<div class="answer">
     <div class="topnavigation">
     <a href="ch01_1.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#01"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch01_3.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
<h3>Antwort:</h3>
<p>Ein Filmklassiker!</p>
<p>(Sie sollten sich die M&uuml;he machen die Frage am Ende jeder Seite zu beantworten. Dadurch werden Sie die besprochenen Konzepte besser erlernen.)</p>

</div>

<!-- LESSON DIVISION -->
<div class="lesson">
<h1>Hardware und Software</h1>

<p>In dem Sie &uuml;ber <em>Der Zauberer von Oz</em> nachdenken, denken Sie &uuml;ber  Informationen nach. Sie werden normalerweise weder &uuml;ber das tats&auml;chliche Material nachdenken, das verwendet wird, um die Information zu speichern (Videofilm oder DVD), noch &uuml;ber das Ger&auml;t, das die Informationen verwendet (Filmprojektor oder DVD-Player).
Eine DVD ist physisch, aber der Film selbst ist eine immaterielle, nicht fassbare Information. Wenn Sie &uuml;ber einen Film sprechen, meinen Sie gew&ouml;hnlich den immateriellen Film, nicht ein bestimmtes Ger&auml;t, das eine Aufnahme von ihm hat. (Auch wenn die menschliche Sprache bewundernswert flexibel ist: Wenn Sie jemand in einem Videogesch&auml;ft bittet ihm den &quot;Zauberer von Oz&quot; zu reichen, werden Sie ihm wahrscheinlich die richtige DVD geben.)</p>

<p>Das Wort Hardware wird f&uuml;r physische Ger&auml;te wie Fernseher, DVD-Player und Computer verwendet. Das Wort Software wird f&uuml;r die Information ben&uuml;tzt, die mit solchen Ger&auml;ten verwendet wird: Filme, Musik, Romane, Computerprogramme und Daten.</p>

<p>Wenn &uuml;ber Computersystem gesprochen wird, bedeutet Hardware die physischen Teile des Computers und Software die Programme und Daten, die von dem physischen Computer verwendet werden.</p>



        <div class="clearfloats">  <!-- divs need something inside of them --> </div>
</div> <!-- end lesson -->

<!-- QUESTION DIVISION -->
<div class="question">
<h3> FRAGE 2:</h3>
<p>
Stellen Sie sich vor, Sie besitzen eine Kopie von <em>Tom Sawyer</em>. Sie zerrei&szlig;en es in St&uuml;cke und stopfen die Papierschnipsel in Ihren M&uuml;lleimer. (Es war wahrscheinlich zum Lesen gedacht.) Haben Sie <em>Tom Sawyer</em> zerst&ouml;rt?
</p>
     <div class="navigation">
     <a href="ch01_1.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#01"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch01_3.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
</div>

</body>
</html>
