<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd" >
<html>
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="author" content="kjell at ieee dot org">
<meta name="copyright" content="2008">
<meta name="germantranslation" content="heinrich at gailer-net dot de">
<meta name="germancopyright" content="2010, Heinrich Gailer">
<meta name="robots" content="index,follow">
<title>Variablen</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css">
</head>

<body>
<!-- generated by CSSmaker.java, version 04/06/2010 on Thu Nov 22 15:28:56 CET 2012 -->

<!-- ANSWER DIVISION -->

<div class="answer">
     <div class="topnavigation">
     <a href="ch09A_1.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#09A"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch09A_3.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
<h3>Antwort:</h3>
<p>
Ja &#8212; das ist der Grund, warum sie Variable genannt wird.
</p>


</div>

<!-- LESSON DIVISION -->
<div class="lesson">
<h1>Variablen</h1>

<a name="Neumann, John von"></a>

<p>
Die Millionen Bytes des Hauptspeichers in Ihrem Computer werden verwendet, um
sowohl Maschinenbefehle als auch Daten zu speichern. Die elektronischen Schaltungen des Hauptspeichers (und aller anderen Arten von Speicher) machen keinen Unterschied zwischen diesen beiden. Wenn ein Programm l&auml;uft, werden einige Speicherstellen f&uuml;r Maschinenbefehle und andere f&uuml;r Daten verwendet. Sp&auml;ter, wenn ein anderes Programm l&auml;uft, werden einige Bytes, die vorher Maschinenbefehle enthielten, jetzt Daten enthalten und einige, die vorher Daten enthielten, werden jetzt Maschinenbefehle enthalten. Die Verwendung des gleichen Speichers sowohl f&uuml;r Befehle als auch f&uuml;r Daten war die Idee von <nobr>John von Neumann,</nobr>
ein Computerpionier (<strong>Hinweis:</strong> Wenn Sie sich &uuml;ber Bytes und Speicherstellen im Unklaren sind, dann lesen Sie bitte <a href="../chap03/ch03_1.html">Kapitel 3</a>.)
</p>

<a name="variable, definition of"></a>
<p>
Um Daten in den Speicher zu stellen und sie sp&auml;ter zur&uuml;ckzubekommen,
muss ein Programm f&uuml;r jeden Speicherabschnitt, den es verwendet, einen Namen haben.
</p>

<blockquote>
<strong>Variable</strong> &#8212; ein Name f&uuml;r eine Speicherstelle im Hauptspeicher,
die einen bestimmten Datentyp verwendet, um einen Wert zu halten.
</blockquote>

<p>
Erinnern Sie sich daran, dass ein Datentyp ein Schema f&uuml;r die Verwendung
von Bitmustern im Hauptspeicher ist, um Daten darzustellen.
(Diese Definition von Variablen ist &uuml;brigens nicht allzu gut.
Sie wird sp&auml;ter ge&auml;ndert werden m&uuml;ssen, wenn Sie mehr dar&uuml;ber lernen was
&quot;wirklich vor sich geht&quot;.)
</p>

<p>
Sie k&ouml;nnen sich eine Variable als eine kleine Box vorstellen, die aus einem oder mehreren Bytes besteht, die wiederum einen Wert eines bestimmten Datentyps enthalten k&ouml;nnen:
</p>

<p style="text-align:center">
<img class="centerimage" src="payAmount.gif"  alt="Box mit dem Inhalt 123">
</p>

<p>
Variablen haben Namen wie <code>lohnbetrag</code>. (Details folgen auf den n&auml;chsten Seiten)
</p>



        <div class="clearfloats">  <!-- divs need something inside of them --> </div>
</div> <!-- end lesson -->

<!-- QUESTION DIVISION -->
<div class="question">
<h3> FRAGE 2:</h3>
<p>
Muss eine Variable immer einen Datentyp haben?
</p>

     <div class="navigation">
     <a href="ch09A_1.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#09A"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch09A_3.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
</div>

</body>
</html>
