<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2000,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title> Kapitel 7 &#8212; Beispielprogramme ausf&uuml;hren</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap07.frames on Wed Oct 24 10:21:14 CEST 2007 -->

<!-- ANSWER AREA -->

<p>
<small>&uuml;berarbeitet 18.01.99, 01/29/2000; &uuml;bersetzt 24.09.03; &uuml;berarbeitet 09.04.04, 23.04.04, 04.04.05, 29.08.06; &copy; Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer</small>
</p>


<div class="answer">
</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1> Kapitel 7 &#8212; Beispielprogramme ausf&uuml;hren</h1>

<p>
Die folgenden Kapitel enthalten viele Java Beispielprogramme.
Sie m&uuml;ssen Sie ausf&uuml;hren und durchspielen.
Es gibt vermutlich keine effektivere M&ouml;glichkeit
Programmieren zu lernen als mit
Beispielprogrammen herumzuspielen.
</p>

<p>
Sie m&uuml;ssen die Programme nicht eintippen, um sie auszuf&uuml;hren.
Wenn Sie das Programm in einem Browserfenster sehen,
k&ouml;nnen Sie es leicht nach Notepad (oder einem anderen Editor) kopieren.
Markieren Sie zuerst den Code, indem Sie in das Fenster klicken
und mit der Maus dar&uuml;ber ziehen.
Klicken Sie dann auf &quot;Bearbeiten&quot; und dann auf &quot;Kopieren&quot; im
Men&uuml; des Browsers (bzw. klicken Sie mit der rechten Maustaste  auf den markierten Text und dann im Kontextmen&uuml; auf &quot;Kopieren&quot; oder Sie kopieren den markierten Text mit Strg + C).
In Notepad klicken Sie auf das Men&uuml; &quot;Bearbeiten&quot; und dann auf &quot;Einf&uuml;gen&quot; (bzw. klicken  mit der rechten Maustaste in das Notepad-Fenster  und dann im Kontextmen&uuml; auf &quot;Einf&uuml;gen&quot; oder Sie f&uuml;gen den kopierten Text mit Strg + V ein).
Jetzt hat Notepad eine Kopie des Programms.
Speichern Sie die Kopie in einer Datei ab, kompilieren Sie das Programm und f&uuml;hren Sie es aus.
</p>

<p>
Wenn Ihnen das absolut klar ist,
k&ouml;nnen Sie dieses Kapitel &uuml;berspringen.
Wenn nicht,
wird Ihnen dieses Kapitel diese Schritte ausf&uuml;hrlich erkl&auml;ren.
</p>

<h4>Themen:</h4>
<ul>
<li>&Uuml;berblick wie Programme kopiert, eingef&uuml;gt, kompiliert und
ausgef&uuml;hrt werden.</li>
<li>Notepad und DOS starten.</li>
<li>Text in die Zwischenablage kopieren.</li>
<li>Text aus der Zwischenablage in Notepad einf&uuml;gen.</li>
<li>Den Text in einer Quelldatei speichern.</li>
<li>Das Programm ausf&uuml;hren.</li>
</ul>

<h3>Hinweise:</h3>
<p><b>1.</b> Diese Schritte werden f&uuml;r einen Computer mit Windows NT 4.0 gezeigt.
Fast die gleichen Schritte k&ouml;nnen f&uuml;r andere Versionen von Windows verwendet werden.
Die Software, die in diesen Aufzeichnungen verwendet wird, ist die minimalst M&ouml;gliche, die erforderlich ist.
Sie ist f&uuml;r alle Windows Computer frei verf&uuml;gbar.
Selbst wenn Sie eine bessere Software haben, ist es wahrscheinlich klug mit dem Minimum zu beginnen.
</p>

<p><b>2.</b> Wenn Sie eine kommerzielle Java Entwicklungsumgebung
(so wie J++ oder JBuilder) verwenden,
k&ouml;nnen Sie diesen Schritten folgen und dabei den Editor Ihrer  Entwicklungsumgebung
an Stelle von Notepad verwenden.
Aber, Notepad zu verwenden k&ouml;nnte schneller sein.
Die meisten kommerziellen Entwicklungsumgebungen setzen voraus, dass
Sie ein gro&szlig;es Projekt einrichten und erfordern viele vorbereitende Schritte.
</p>


<p><b>3.</b> Anstelle von Notepad k&ouml;nnen Sie auch JCreator verwenden.
Diese Entwicklungsumgebung ist leicht zu bedienen und als Freeware kostenlos.
JCreator finden Sie bei <a href="http://www.jcreator.com/">jcreator.com/</a>.
</p>


<p><b>4.</b> Oder Sie k&ouml;nnen Code-Genie verwenden.
Es ist einfach, leicht zu bedienen und preiswert,
aber es ist eine gro&szlig;e Verbesserung gegen&uuml;ber Notepad.
Code-Genie finden Sie bei <a href="http://www.code-genie.com">code-genie.com</a>.
</p>

<p><b>5.</b> Eine weitere kleine, kostenlose Java Entwicklungsumgebung
ist <b>BlueJ</b> und k&ouml;nnte f&uuml;r Sie die beste Wahl sein.
Aber Sie werden ein paar Anpassungen vornehmen m&uuml;ssen.
BlueJ finden Sie bei <a href="http://www.bluej.org">bluej.org</a>.
</p>



</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 1:</h3>
<a href="ch07_2.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
Ist es manchmal vorteilhafter ein Programm einzutippen
als es nur zu kopieren?
</p>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#07">Inhaltsverzeichnis</a>
</div>

</body>
</html>
