<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2002,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2004 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Konstruktoren f&uuml;r Vector-Objekte</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap54.frames on Wed Oct 24 11:12:41 CEST 2007 -->

<!-- ANSWER AREA -->

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
<code>Object</code> ist die Klasse, die alle anderen Klassen als Superklasse haben.
</p>


</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Konstruktoren f&uuml;r <code><strong>Vector</strong></code>-Objekte</h1>
<A NAME="Vector, constructors"></A>
<p>
Um eine Referenzvariable vom Typ <code>Vector</code> zu deklarieren, tun Sie folgendes:
</p>

<pre class="code">
Vector meinVector;        // meinVector ist eine Referenz
                          // auf ein zuk&uuml;nftiges Vector-Objekt
</pre>

<p>
Sie sagen nicht, welchen Typ von Objekt Sie zu speichern beabsichtigen.
Ein <code>Vector</code> l&auml;&szlig;t sich mit einem Array von <code>Object</code>-Referenzen vergleichen.
Das bedeutet, dass jede beliebige Objektreferenz in einem <code>Vector</code> gespeichert werden kann.
Um eine Variable zu deklarieren und einen <code>Vector</code> mit einer  <em>nicht spezifizierten</em> Kapazit&auml;t zu konstruieren, tun Sie das:
</p>

<pre class="code">
Vector meinVector = new Vector();   // meinVector ist eine Referenz auf ein Vector-Objekt.
                                    // Das Java System w&auml;hlt die Anfangskapazit&auml;t.
</pre>

<p>
Das mag nicht sonderlich effizient sein.
Wenn Sie eine Vorstellung &uuml;ber die Kapazit&auml;t haben, die Sie ben&ouml;tigen,
dann erzeugen Sie Ihren <code>Vector</code> mit dieser Kapazit&auml;t.
Um eine Variable zu deklarieren und einen <code>Vector</code> mit einer Anfangskapazit&auml;t von 15 zu konstruieren, tun Sie das:
</p>

<pre class="code">
Vector meinVector = new Vector(15); // meinVector ist eine Referenz auf ein Vector-Objekt,
                                    // mit einer Anfangskapazit&auml;t von 15 Elementen.
</pre>

<p>
Die Anfangskapazit&auml;t ist die Gr&ouml;&szlig;e mit der das  <code>Vector</code>-Objekt beginnt.
Es kann vergr&ouml;&szlig;ert werden, wenn Sie mehr Elemente hinzuf&uuml;gen.
Die Erweiterung der Kapazit&auml;t eines <code>Vector</code>-Objekts ist langsam
und wird Ihr Programm verlangsamen, wenn das zu oft vorkommt.
Um eine bessere Kontrolle zu haben, k&ouml;nnen Sie angeben wie viele neue Slots
bei der Erweiterung des <code>Vector</code>-Objekts hinzugef&uuml;gt werden sollen:
</p>

<pre class="code">
Vector meinVector = new Vector(15, 5); // meinVector ist eine Referenz auf ein Vector-Objekt,
                                       // mit einer Anfangskapazit&auml;t von 15 Elementen
                                       // und einer <em>Inkrementgr&ouml;&szlig;e</em> von 5.
</pre>

<p>
Wenn jetzt zus&auml;tzliche Kapazit&auml;t ben&ouml;tigt wird, werden 5 Slots auf einmal hinzugef&uuml;gt.
Sie m&uuml;ssen die neuen Slots nicht f&uuml;llen, aber jetzt sind sie da, wenn Sie sie ben&ouml;tigen.
</p>


</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 5:</h3>
<a href="ch54_6.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
Sie schreiben ein Programm, um die &Uuml;bersicht &uuml;ber die Studenten einer Klasse zu behalten.
Es gibt &uuml;blicherweise ungef&auml;hr 12 Studenten in einer Klasse,
aber es ist nicht ungew&ouml;hnlich, dass w&auml;hrend der ersten Wochen neue Studenten hinzukommen.
Deklarieren und konstruieren Sie f&uuml;r diese Situation ein geeignetes <code>Vector</code>-Objekt.
</p>

<pre class="code">
Vector meineKlasse = new Vector( <span class="blue">__________, __________</span> ) ;
</pre>


</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#54">Inhaltsverzeichnis</a>
</div>

</body>
</html>
