<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd" >
<html>
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="author" content="kjell at ieee dot org ">
<meta name="copyright" content="2008">
<meta name="germantranslation" content="heinrich at gailer-net dot de">
<meta name="germancopyright" content="2010, Heinrich Gailer">
<meta name="robots" content="index,follow">
<title>I/O</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css">
</head>

<body>
<!-- generated by CSSmaker.java, version 04/06/2010 on Tue Mar 20 15:32:24 CET 2012 -->

<!-- ANSWER DIVISION -->

<div class="answer">
     <div class="topnavigation">
     <a href="ch10_1.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#10"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch10_3.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
<div class="questionEcho">
<p>
Wenn ein Computerprogramm eine <em>Input</em>-Operation durchf&uuml;hrt, in welche Richtung flie&szlig;en die Daten?
</p>
</div>
<h3>Antwort:</h3>
<p>
Von einem &auml;u&szlig;eren Ger&auml;t <em>in</em> das Programm.
</p>

</div>

<!-- LESSON DIVISION -->
<div class="lesson">
<h1>I/O</h1>

<p>
Input und Output sind so gebr&auml;uchlich, dass daf&uuml;r eine Abk&uuml;rzung gebildet wurde: <strong>IO</strong> (ausgesprochen eye-oh). I/O-Operationen sind sehr kompliziert, sowohl auf der Software-Ebene als auch auf der elektronischen Ebene. Ein Teil des Problems besteht darin, dass die Art in der Daten <em>au&szlig;erhalb</em> des Computers organisiert sind, sich von der Art unterscheidet, in der sie <em>innerhalb</em> des Computers organisiert sind.
Jede Menge an Berechnungen ist notwendig, um die Daten zwischen den verschiedenen Formen zu konvertieren. Gl&uuml;cklicherweise ist das meiste dieser Schwierigkeit innerhalb der Methoden verborgen, die Ihr Programm  verwenden kann.
</p>

<a name="package"></a>

<p>
Diese Aufzeichnungen verwenden die Klasse <code>java.util.Scanner</code>, um Input durchzuf&uuml;hren. <code>Scanner</code> ist neu in Java 5.0. <code>Scanner</code> ist kein fundamentaler Teil der Sprache Java, aber sie ist Teil des Pakets <code>java.util</code>,
das Sie in ihr Programm einbinden k&ouml;nnen.

Ein <strong>Paket</strong> ist eine Sammlung von Klassen, die in Ihrem Programm verwendet werden k&ouml;nnen. Stellen Sie sich ein <strong>Paket</strong> als eine Toolbox vor, und die Klassen darin als Tools. Verschiedene Programme brauchen unterschiedliche Hilfsmittel und binden verschiedene Pakete ein.
</p>

<p>
Es mag Ihnen seltsam vorkommen, dass Java selbst keine eingebaute I/O hat. Der Grund daf&uuml;r ist, dass es sehr viele Arten von I/O gibt und, dass eine Sprache, die alle eingebaut h&auml;tte, zu umfangreich und schwerf&auml;llig w&auml;re. Eine Sprache, die f&uuml;r professionelle Softwareentwicklung verwendet wird, so wie Java (C, C++ oder irgendeine von mehreren anderen) erlaubt es dem Programmierer sich das richtige IO-Paket f&uuml;r den Job auszuw&auml;hlen.
</p>


        <div class="clearfloats">  <!-- divs need something inside of them --> </div>
</div> <!-- end lesson -->

<!-- QUESTION DIVISION -->
<div class="question">
<h3> FRAGE 2:</h3>
<p>
Ihr Auto verf&uuml;gt &uuml;ber einen Computer, der den Motor steuert, w&auml;hrend er die Daten von zahlreichen Sensoren &uuml;berwacht. F&uuml;hrt dieser Computer Input und Output durch?
</p>


     <div class="navigation">
     <a href="ch10_1.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#10"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch10_3.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
</div>

</body>
</html>
