<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2002,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Dateitypen</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap03.frames on Tue Apr 21 15:27:11 CEST 2009 -->

<!-- ANSWER AREA -->

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
Bei modernen Computersystemen kann nur das Betriebssystem direkt alles mit
Dateien auf der Festplatte tun.
Welche Auswirkungen hat dies auf:
</p>

<ol>
<li>die Sicherheit des Systems?
    <ul><li>  <span class="blue">Die Sicherheit hat zugenommen, da Programme, die versuchen     gef&auml;hrliche oder dumme Sachen mit Dateien zu tun, es nicht k&ouml;nnen.
    Sie m&uuml;ssen das Betriebssystem fragen, das nur sichere und vern&uuml;nftige Dinge zul&auml;sst.</span></li></ul></li>
<li>Computerspiele?
    <ul><li> <span class="blue">&Auml;ltere Computerspiele haben die Handhabung von Dateien
    selbst durchgef&uuml;hrt, ohne das Betriebssystem zu fragen.
    (Das alte DOS war dumm und langsam und viele Applikationsprogramme ignorierten es.)
    Diese Spiele w&uuml;rden auf modernen Computern nicht mehr laufen.</span></li></ul></li>
<li>den Komfort bei der Erstellung von Programmen?
    <ul><li> <span class="blue">Die Programmerstellung ist leichter,
    da die Arbeit mit Dateien vom Betriebssystem erledigt wird.</span></li></ul></li>
</ol>

</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Dateitypen</h1>
<A NAME="file types"></A>
<p>
Soweit es die Festplatte betrifft sind alle Dateien gleich.
Auf der elektronischen Ebene gibt es keinen Unterschied
zwischen einer Datei, die ein Programm enth&auml;lt und einer Datei, die Daten enth&auml;lt.
Alle Dateien sind benannte Kollektionen von Bytes.
Nat&uuml;rlich, f&uuml;r was die Dateien <em>verwendet</em> werden, das ist verschieden.
Das Betriebssystem kann eine Programmdatei nehmen, sie in den Hauptspeicher kopieren
und beginnen sie auszuf&uuml;hren.
Das Betriebssystem kann eine Datendatei nehmen und deren Information einem
laufenden Programm zur Verf&uuml;gung stellen, wenn es danach verlangt.
</p>

<A NAME="file, executable"></A>
<A NAME="file names"></A>
<p>
H&auml;ufig zeigt der letzte Teil eines Dateinamens (die <em>Endung</em>)
f&uuml;r welchen Gebrauch die Datei verwendet wird.
Zum Beispiel in "meineDaten.txt" bedeutet ".txt", dass die Datei als Kollektion von Text zu verwenden sein wird,
das hei&szlig;t als Sammlung von Zeichen.
Bei "Netscape.exe" bedeutet ".exe", dass die Datei "ausf&uuml;hrbar" ist,
das hei&szlig;t ein Programm, dass bereit ist ausgef&uuml;hrt zu werden.
Bei "Programm1.java" bedeutet ".java", dass die Datei ein Quellprogramm
in der Sprache Java ist (&uuml;ber Quellprogramme wird es sp&auml;ter in diesen Aufzeichnungen noch mehr geben).
F&uuml;r die Festplatte ist jede dieser Dateien das gleiche: eine Sammlung von Bytes.
</p>

</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 14:</h3>
<a href="ch03_15.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
Was passiert, wenn eine Datei f&uuml;r etwas anderes als ihren beabsichtigten Gebrauch verwendet wird?
Was passiert zum Beispiel, wenn Sie versuchen eine ".EXE" Datei mit einem Textverarbeitungsprogramm zu &ouml;ffnen?
</p>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#03">Inhaltsverzeichnis</a>
</div>

</body>
</html>
