<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2002,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Kopierte Information</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap03.frames on Tue Apr 21 15:27:11 CEST 2009 -->

<!-- ANSWER AREA -->

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
Nein. Die verschiedenen M&ouml;glichkeiten ein Bit zu speichern
&auml;ndern nicht die Information, die gespeichert wird.
</p>

</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Kopierte Information</h1>
<p>
Information, die in bin&auml;rer Form gespeichert ist,
&auml;ndert sich nicht, wenn sie von einem Medium (Speichermethode) auf ein anderes kopiert wird,
und es kann eine unbegrenzte Anzahl solcher Kopien gemacht werden
(denken Sie an die Vorteile des Bin&auml;ren).
Das ist eine &auml;u&szlig;erst m&auml;chtige Kombination.
Sie m&ouml;gen sich so daran gew&ouml;hnt haben, dass es Ihnen allt&auml;glich erscheint.
Aber wenn Sie ein Bild aus dem Internet herunterladen,
werden die Daten Dutzende Mal kopiert,
unter Verwendung einer Vielzahl von Speicher- und &Uuml;bertragungsmethoden.
</p>
<p>
Es ist zum Beispiel wahrscheinlich, dass die Daten sich von einer
magnetischen Festplatte aufmachen
und dann in den Hauptspeicher eines Computers einer Website kopiert werden
(was ein Spannungssignal zur Folge hat).
Vom Hauptspeicher werden sie (wieder durch ein Spannungssignal) auf eine Netzkarte kopiert,
die sie tempor&auml;r in vielen Transistoren h&auml;lt.
Von dort werden sie als ein elektronisches Signal durch eine Leitung geschickt.
Den Weg entlang zu Ihrem Computer,
es kann Dutzende von Computern geben, die die Daten aus einem elektronischen Signal
in den Hauptspeicher in Transistorform transformieren, dann zur&uuml;ck als
elektronisches Signal auf ein anderes Kabel.
Ihre Daten k&ouml;nnten sogar in ein Funksignal transformiert werden,
zu einem Satelliten (mit seinen eigenen Computern) geschickt werden und mit einem anderen Funksignal zur Erde zur&uuml;ckgeschickt werden.
Letztendlich landen die Daten in Ihrer Videokarte (Transistoren), die sie
in ein TV Signal f&uuml;r Ihren Bildschirm transformiert.
</p>

<p>
Der Kernpunkt bei all dem ist, dass sich die tats&auml;chliche Information (in diesem Beispiel das Bild) von einem Medium zum n&auml;chsten nicht &auml;ndert.
</p>

</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 4:</h3>
<a href="ch03_5.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
<em>Analoge Daten</em> (sich fortlaufend &auml;ndernde Signale), wie Schallplatten-
oder Kassettenaufnahmen, k&ouml;nnen ebenfalls von Medium zu Medium kopiert werden.
&Auml;ndert sich die Information analoger Daten, wenn sie auf ein anderes Medium kopiert werden?
</p>
</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#03">Inhaltsverzeichnis</a>
</div>

</body>
</html>
