<!doctype html public "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd" >

<html>
<head>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="author" content="kjell at ieee dot org">
<meta name="copyright" content="2008">
<meta name="germantranslation" content="heinrich at gailer-net dot de">
<meta name="germancopyright" content="2010, Heinrich Gailer">
<meta name="robots" content="index,follow">
<meta name="robots" content="noindex,nofollow">
<title>Programmieraufgaben</title>
<link rel="stylesheet" href="../ExerciseStyle.css" type="text/css">

</head>

<body>

<p class="revisions">erstellt 30.07.99; &uuml;bersetzt 01.03.03; &uuml;berarbeitet 12.11.03, 21.04.04, 11.04.05, 29.09.06, 10.04.10; Deutsche &Uuml;bersetzung Heinrich Gailer</p>

<hr>

<h1>Kapitel 9B  Programmieraufgaben</h1>

<p>
<strong>Allgemeine Hinweise:</strong>
Schreiben Sie jedes Programm wie angegeben. Keines dieser Programme erwartet die Eingabe von Daten durch den Anwender. Die Werte, die von den Programmen verwendet werden, sind durch Deklaration und Zuweisungsanweisungen  fest kodiert. Das ist normalerweise eine schlechte Form der Programmierung. Die Eingabe von Daten wird in den Kapiteln 10 und 11 behandelt. Sobald Sie diese Kapitel gelesen haben, k&ouml;nnen Sie zur&uuml;ckkommen und eine bessere Version dieser Programme schreiben.
</p>

<p>
<b>Hinweis:</b>
Jede Aufgabe verlangt, dass Sie das Programm mehrmals mit verschiedenen Werten ausf&uuml;hren. Das ist ein wichtiger Bestandteil der Aufgabe! Experimentieren Sie mit Ihren Programmen. Nur so bekommen Sie ein grundlegendes Verst&auml;ndnis f&uuml;r Ihr Programm und ein Gef&uuml;hl f&uuml;r das Programmieren.
</p>


<h2>Aufgabe 1 &#8212; Durchschnittliche Niederschlagsmenge</h2>

<p>Schreiben Sie ein Programm, das die durchschnittliche Niederschlagsmenge f&uuml;r die drei Monate April, Mai und Juni berechnet. Deklarieren und initialisieren Sie eine <code>int</code>-Variable f&uuml;r jeden Monat. Berechnen Sie den Durchschnitt und geben Sie das Ergebnis in folgender Form aus:
</p>

<pre class="dos">
Niederschlag im April:    12
Niederschlag im Mai  :    14
Niederschlag im Juni :    8
Durchschnitt:             11.333333333333334
</pre>

<p>Verwenden Sie das Tabulatorzeichen '\t', um die Zahlen auszurichten. &Uuml;berpr&uuml;fen Sie ob Ihr Programm das richtige Ergebnis ausgibt. Welcher Anf&auml;ngerfehler kann bei dieser Aufgabe gemacht werden?
Erkennen Sie ihn?
</p>

<p>Zur&uuml;ck zum <a href="../../index.html#09B">Inhaltsverzeichnis</a>.</p>

<hr>

<h2>Aufgabe 2 &#8212; Trigonometrie</h2>

<p>Um den Sinus eines Gleitpunktwerts mit doppelter Genauigkeit zu berechnen, verwenden Sie diese Methode:
</p>

<pre>
Math.sin( zahl )
</pre>

<p>Der <em>Wert</em> wird in Bogenma&szlig; angegeben (nicht in Grad.)
Der <em>Cosinus</em> wird mit</p>

<pre>
Math.cos( zahl )
</pre>

<p>berechnet. Noch einmal, der <em>Wert</em> ist in Bogenma&szlig;.
Schreiben Sie ein Programm, das folgendes berechnet:
</p>

<ol>
<li>Den Sinus von 0.5235 Bogenma&szlig;. Das Ergebnis wird in einer Variablen <var>sinx</var> gespeichert.
<li>Den Cosinus von 0.5235 Bogenma&szlig;. Das Ergebnis wird in einer Variablen <var>cosx</var> gespeichert.
<li>Die Summe des Quadrats von jedem dieser Werte (verwenden Sie die Variablen).
    Das Ergebnis wird in einer dritten Variablen <var>ergebnis</var> gespeichert.
<li>Geben Sie die drei Variablen aus.
</ol>

<p>Verwenden Sie f&uuml;r die Ausgabe:</p>

<pre>
System.out.println("Sinus: " + sinx + " Cosinus: " + cosx + " Ergebnis: " + ergebnis );
</pre>

<p>Testen Sie neben 0.5235 ein paar andere Werte.</p>

<p>Zur&uuml;ck zum <a href="../../index.html#09B">Inhaltsverzeichnis</a>.</p>

<hr>

<h2>Aufgabe 3 &#8212; Grad in Bogenma&szlig;</h2>

<p>Es ist manchmal schwierig in Bogenma&szlig; zu denken; wir w&uuml;rden lieber Grad verwenden. Erinnern Sie sich (an jene dunklen Klassentage mit Trigonometrie),
dass es PI Bogenma&szlig; je 180 Grad gibt. Also um einen Winkel, gegeben in Grad, in Bogenma&szlig; umzurechnen, tun Sie das:
</p>

<pre>
bogenmass = grad * Math.PI/180
</pre>

<p>Math.PI gibt Ihnen den genauen Wert von PI.</p>

<p>
Editieren Sie das vorherige Programm, so dass es die gleichen Dinge tut.
Aber jetzt ist der Winkel 30 Grad (den Sie in Bogenma&szlig; konvertieren werden).
</p>

<p>Zur&uuml;ck zum <a href="../../index.html#09B">Inhaltsverzeichnis</a>.</p>

<hr>

<p>Ende  der Aufgaben</p>

</body>
</html>