<?xml version="1.0" encoding="UTF-8"?>
<!doctype html public "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de"
lang="de">
<html>
<head>
<title>Java Tutorial - FAQ
</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<meta http-equiv="copyright" content="1999, 2000, 2002  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung heinrich@gailer-net.de" />
<meta name="keywords" content="Java Tutorial, Kjell, Java, deutsche Version, german version,  interaktives Tutorial, interaktiv, Tutorial, Programmieren lernen, fortgeschritten, Java Lektionen, german, deutsch, programmiertes Lernen">
<meta name="description" content="Vollst&auml;ndiger Kurs in Java Programmierung f&uuml;r Anf&auml;nger unter Einsatz des programmierten Lernens.">
<link rel="stylesheet" href="../../css/default.css" type="text/css" />
<link rel="stylesheet" href="style.css" type="text/css" />
</head>

<!--BGCOLOR="#f8fff4"-->
<body>
<div class="navbar">

<span title="Zur Startseite gehen."><a class="navin" href="../../index.html">www.gailer-net.de</a></span>&nbsp;

<img src="../../images/arrow.gif" width="22" height="10" alt="arrow" />&nbsp;

<a class="navin" href="java-toc.html" title="Zur Startseite des Java Tutorials gehen.">Java Tutorial</a>&nbsp;

<img src="../../images/arrow.gif" width="22" height="10" alt="arrow" />&nbsp;FAQ

<!-- copyright 2001 by Bradley Kjell-->
<!-- Author:  Bradley Kjell kjell@ieee.org  -->
</div>

<div style="margin-top:5px;margin-left:3px;">

<center><h1>FAQ &#8212; H&auml;ufig gestellte Fragen & Antworten<span style="font-size:0.5em;">(Frequently Asked Questions)</span>
</h1>
</center>

<h3>Worum geht es in diesen Aufzeichnungen?</h3>

<p>
Diese Aufzeichnungen sind ein Experiment, in dem die Lernmethode der &quot;programmierten, computergest&uuml;tzten Unterweisung (CAI - Computer Aided Instruction) eingesetzt wird.
Das Thema ist Java Programmierung f&uuml;r Anfangsprogrammierer.
Das Ziel ist:
</p>

<ol>
<li>Anfangsprogrammierer auf den Weg zu einer professionellen Stufe der Programmierung zu bringen.</li>

<li>Durch die Bereitstellung von sehr viel Feedback, den Lernprozess zu verst&auml;rken.</li>
</ol>

<p>
Diese Aufzeichnungen begannen als Erg&auml;nzung zu einem Universit&auml;tskurs &uuml;ber Informatik f&uuml;r Anf&auml;nger.
Ihr Zweck war es, zus&auml;tzlichen Diskussionsstoff und viele Beispiele zu den grunds&auml;tzlichen Themenfeldern der Programmierung bereitzustellen.<br /><br />
Typische Universit&auml;tstexte behandeln den Anfangsstoff im Eiltempo
(vielleicht, weil dieser Text <em>alle</em> Themen abhandeln muss).
Typische Java Durchschnittsb&uuml;cher sind bei diesen Themen ebenfalls oberfl&auml;chlich.
(oft setzt das Buch voraus, dass der Leser schon ein Programmierer ist).<br /><br />
Diese Aufzeichnungen versuchen diese L&uuml;cke zu f&uuml;llen.
Sie behandeln nicht alle Themen,
aber sie behandeln die grunds&auml;tzlichen Themen sehr ausf&uuml;hrlich.
Diesen Aufzeichnungen liegt die Methode des <em>Programmierten Lernens</em> zugrunde.
Ich hoffe, es ist mir gelungen das Lehrmaterial interessant zu gestalten.
</p>

<hr />

<h3>Was ist <em>Programmiertes Lernen</em>?</h3>
<p> <em>Programmiertes Lernen</em> ist eine Methode der strukturierten Anleitung, mit der
nach jedem neuen Begriff, dem Lernenden eine Frage gestellt wird, um den Lernstoff zu verfestigen. Die Anleitung erfolgt in der Form</p>

<blockquote>
Lerneinheit <img src="arrow.gif" align="center">  Frage <img src="arrow.gif" align="center"> Antwort <img src="arrow.gif" align="center"> Lerneinheit <img src="arrow.gif" align="center"> Frage <img src="arrow.gif" align="center"> Antwort <img src="arrow.gif" align="center"> . . . . .
</blockquote>

<p>Die Lerneinheiten sind kurz, und die Fragen sind leicht zu beantworten. Das regelm&auml;&szlig;ige Feedback f&uuml;hrt beim Lernenden zu einem aktiven Lernen, und damit
zu einem besseren Verst&auml;ndnis und zur Verfestigung des Gelernten.<br /><br />
Viele Studien haben gezeigt, dass diese Methode sehr wirkungsvoll ist,
besonders bei Anfangslektionen mit fachlichen Themen.
Wenn ein Lernender geistig angeregt wird, indem er jede Frage beantwortet und die Antwort &uuml;berpr&uuml;ft, ist der Lernprozess viel schneller.<br /><br />

<p>
<em>Programmiertes Lernen</em> war besonders zwischen 1960 und 1970 popul&auml;r.
Es wurde &uuml;blicherweise in B&uuml;chern eingesetzt (mit Lerneinheiten, Frage und Antwort waren  durch breite Balken getrennt, oder sie waren jeweils auf einer eigenen Seite). Das war nicht allzu sinnvoll.</p>

<p>
An gro&szlig;en Universit&auml;ten wurde es auf Gro&szlig;rechner mit besonderen (und <em>sehr teuren</em> Terminals) f&uuml;r Studenten eingesetzt.
Nur bevorzugte Studenten bekamen Maschinenzeit, und ein Stab von Technikern und
Programmierern wurde ben&ouml;tigt, um alles am Laufen zu halten.
</p>

<p>
Heute ist diese Technik durch das Internet preiswert und einfach geworden.
Seltsamerweise verwendet sie niemand mehr.
</p>

<hr />

<h3>Wenn das Beantworten einfacher Fragen so wirkungsvoll ist, sind dann hochgradig interaktive, multimediale Methoden nicht noch wirkungsvoller?</h3>
<p>
M&ouml;glich.
Aber die Erstellung ist sicherlich zeitaufwendiger.
Und ich vermute, dass einige von ihnen wenig zum tats&auml;chlichen Lernprozess beitragen.
Der gr&ouml;&szlig;te Wirkungsgrad an Interaktion von Anwendern kann
mit einfachen Methoden erreicht werden.
Diese Aufzeichnungen sind als ein inoffizielles Experiment geschrieben worden,
um zu sehen, ob diese These glaubw&uuml;rdig ist.
</p>
 <hr />

<h3>Ist der Wirkungsgrad dieser Aufzeichnungen getestet worden?</h3>
<p>
Diese Aufzeichnungen sind im Klassenraum erprobt worden &#8212;
das hei&szlig;t sie wurden als Erg&auml;nzung in richtigen Klassen
verwendet und auf der Grundlage jener Experimente geschrieben und angepasst.
Es fand keine formale &Uuml;berpr&uuml;fung dieser Aufzeichnungen statt.
Aber viele Studenten haben viel Gutes &uuml;ber sie ge&auml;u&szlig;ert
(besonders am Ende des Semesters, wenn die Pr&uuml;fungen anstanden).
</p>

<hr />

<h3>Mit J++ (und anderen Entwicklungsumgebungen) bleibt das DOS-Fenster nicht stehen,
nachdem das Programm beendet ist. Wie kann das erreicht werden?</h3>

<p>
Dieses Problem ist eine Eigent&uuml;mlichkeit vieler kommerzieller Entwicklungsumgebungen.
Hier ist zum Beispiel ein korrektes <em>Hello World</em> Programm:
</p>

<blockquote><pre>
class Hello
{
  public static void main ( String[] args )
  {
    System.out.println("Hello World!");
  }
}
</pre></blockquote>

<p>
Wenn Sie in J++ auf "<em>execute</em>" klicken, wird das Programm seinen Output
(die Zeichen &quot;Hello World!&quot;) auf das DOS-Fenster ausgeben,
das aber zu kurz eingeblendet wird, um es sehen zu k&ouml;nnen.
</p>

<p>
Es gibt mehrere M&ouml;glichkeiten mit diesem Problem umzugehen.
Eine M&ouml;glichkeit besteht darin, das Programm so zu ver&auml;ndern,
dass es kurz bevor es beendet wird, auf eine Eingabe wartet.
Der Code in rot kann in jedes Programm eingef&uuml;gt werden.
</p>

<blockquote><pre>
<font color=red>import java.io.*;</font>

class Hello
{
  public static void main ( String[] args ) <font color=red>throws IOException</font>
  {
    System.out.println("Hello World!");

    <font color=red>System.out.println("Programmende mit Enter");
    System.in.read();</font>
  }
}
</pre></blockquote>

<p>
Eine andere M&ouml;glichkeit, um mit diesem Problem umzugehen besteht darin,
J++ (oder eine andere Umgebung) zum Editieren und Kompilieren zu verwenden,
aber f&uuml;r die Programmausf&uuml;hrung Ihr eigenes DOS-Fenster zu verwenden.
Um das zu tun, starten Sie ein DOS-Fenster und wechseln dann in das Verzeichnis, in dem sich der kompilierte Bytecode befindet (zum Beispiel <code>Hello.class</code>.)
F&uuml;hren Sie dann den unten stehenden Code im DOS-Fenster aus:
<p>

<blockquote><pre>
java Hello.class
</pre></blockquote>

<p>
Die Portabilit&auml;t von Java stellt sicher, dass der
mit J++ (oder einer anderen Umgebung) kompilierte Code
mit der <em>Java Virtuellen Maschine</em>, die ein Bestandteil des JDK ist, funktionieren wird.
</p>

<hr />
<a name="download"></a>
<h3>K&ouml;nnen diese Aufzeichnungen Offline verwendet werden?</h3>
<p>
Die folgende ZIP-Datei enth&auml;lt das gesamte Lehrmaterial. Die Erlaubnis zum Download f&uuml;r den privaten Gebrauch oder f&uuml;r den Gebrauch an &ouml;ffentlichen, nicht kommerziellen Bildungseinrichtungen wird erteilt. Beachten Sie bitte die <a href="../../html/legalnotice.html">rechtlichen Hinweise</a>.
</p>

<ul>
<li><a title="ZIP-Datei herunterladen." <a href="../../zip/JavaNotes_de.zip">JavaNotes_de.zip</a> (ca. 15 MB).
</li>
</ul>

<p>Wenn Sie die ZIP-Datei nicht herunterladen m&ouml;chten, tun Sie folgendes. Jedes Kapitel ist eine lineare Sequenz von Seiten (d.h. jede Seite ist mit der n&auml;chsten Seite verlinkt ohne andere Abzweigungen). Klicken Sie auf ein Kapitel, und dann, ohne die Seiten zu lesen, auf den Link am Ende der Seite bis Sie das Ende des Kapitels erreicht haben. Jetzt haben Sie alle Seiten in Ihrem Browsercache und k&ouml;nnen Offline gehen und die Seiten in Ihrem eigenen Arbeitstempo lesen.
</p>

<p>
Einige Browser unterst&uuml;tzen den Download aller Seiten einer Website mit einem Klick.
Das funktioniert ebenfalls gut mit dieser Website.
</p>

<hr />


<h3>K&ouml;nnen diese Aufzeichnungen mit einem Textbuch verwendet werden?</h3>
<p>
Ja. Die Reihenfolge der Themen kann unterschiedlich sein, aber es sollte m&ouml;glich sein ein Textbuch und diese Anweisungen als Erg&auml;nzung zu lesen.
Viele Leser arbeiten diese Aufzeichnungen durch, w&auml;hrend sie einen regul&auml;ren <em>College</em> oder <em>High School</em> Kurs belegen. Die meisten Textb&uuml;cher haben ihre eigenen Input/Output-Klassen, die installiert werden m&uuml;ssen. Diese sind &uuml;blicherweise einfacher zu verwenden, als die fundamentalen Input/Output-Methoden von Java, die in diesen Aufzeichnungen verwendet werden.
<p>

<hr />

<h3>Was sollte ich lesen, wenn ich mit diesen Aufzeichnungen fertig bin?</h3>
<p>
Das Beste, was Sie tun k&ouml;nnen, ist selbst viele Programme zu schreiben.
Wenn Sie ein weiteres Java Programmierbuch lesen wollen,
haben Sie drei M&ouml;glichkeiten:
<ol>
<li>W&auml;hlen Sie ein Standardbuch, &uuml;ber allgemeine Java-Programmierung.
    Vielleicht eines mit einem Touch Multimedia.</li>
<li>W&auml;hlen Sie ein fortgeschrittenes Buch, &uuml;ber ein spezielles Java-Thema
    wie Netzwerkprogrammierung oder Bildbearbeitung.</li>
<li>W&auml;hlen Sie ein allgemeines Java-Programmierbuch, das
    f&uuml;r den erfahrenen Programmierer gedacht ist.</li>
</ol>

<p>
Die folgenden B&uuml;cher sind f&uuml;r erfahrene Programmierer.
F&uuml;r den Anf&auml;nger d&uuml;rften sie schwieriger sein.
<p>

<ul>
<li>Cornell und Horstmann, <em>Core Java,</em> (in 2 B&auml;nden)
    <ul><li>Deckt geradlinig und unkompliziert alle Java-Themen ab.
            Es ist wahrscheinlich das am besten verkaufte Buch &uuml;ber Java.
    </li></ul></li>
<li>Campione und Walrath, <em>Das Java Tutorial</em>
    <ul><li>Online erh&auml;ltlich (umsonst!) bei <a class="linkout" title="Zum Online-Tutorial von java.sun gehen." href="http://java.sun.com/docs/books/tutorial/#basics">java.sun.com</a>.
        </li></ul></li>
</ul>

<hr />

<h3>Wo sind all die fehlenden Kapitel?</h3>
<p>
Die L&uuml;cken in der Kapitelnumerierung sind f&uuml;r die noch zu schreibenden Kapitel gedacht. Sie sind da, damit zuk&uuml;nftige Kapitel leichter eingef&uuml;gt werden k&ouml;nnen, ohne alles neu numerieren zu m&uuml;ssen.
</p>

<hr />

<h3>K&ouml;nnen diese Aufzeichnungen auf Papier ausgedruckt werden?</h3>
<p>
Ja, indem Sie die &quot;Drucken&quot;-Funktion Ihres Browsers verwenden.
Aber das Ergebnis ist h&auml;sslich,
und Sie verlieren die meisten der interaktiven Merkmale.
Ich habe es nicht getan, aber ich wei&szlig;, dass es viele Anwender getan haben.
Die Aufzeichnungen bestehen aus ca. 1200 Webseiten. Wenn Sie diese Seiten alle ausdrucken, werden Sie wesentlich mehr als 1200 Seiten Papier brauchen, da viele der einzelnen Webseiten beim Ausdrucken zwei oder mehr Seiten ben&ouml;tigen.
</p>

<hr />

<h3>Wann werden diese Aufzeichnungen jemals fertig sein?</h3>
<p> Das ist die Frage, die <em>ich</em> mir am h&auml;ufigsten stelle... </p>

<hr />

<p></a>
&#8212;&#8212; Zur&uuml;ck zum <a href="java-toc.html">Inhaltsverzeichnis</a>.
</p>
</div>
</body>
</html>