<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2002,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Objektorientierte Programmierung</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap30.frames on Wed Oct 24 10:44:09 CEST 2007 -->

<!-- ANSWER AREA -->


<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>

<ul>
<li>Eine <em>Klasse</em> ist eine Beschreibung eines m&ouml;glichen Objekts.</li>
<li>Ein <em>Objekt</em> ist eine eindeutige Instanz einer Klasse.</li>
</ul>

<p>
Oder Sie k&ouml;nnten sagen, eine Klasse ist ein Bauplan f&uuml;r ein Objekt,
und ein Objekt ist das Ergebnis der Planausf&uuml;hrung.
</p>


</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Objektorientierte Programmierung</h1>
<A NAME="object oriented programming"></A>
<p>
Objektorientierte Programmierung
(in Java oder in irgendeiner anderen objektorientierten Sprache)
besteht aus drei Phasen:
</p>

<ol>
<li>Erzeugen des Programms.
    <ul>
    <li>Der Programmierer <span class="red">definiert Klassen, die zuk&uuml;nftige Objekte beschreiben</span>,
        welche das Programm zur Laufzeit nutzen wird.</li>
    <li>Der Programmierer definiert eine Klasse, die die statische Methode
        <code>main()</code> enth&auml;lt, um das Programm zu starten.</li>
    </ul></li><br />

<li>Kompilieren des Programms.
    <ul>
    <li>Das Programm wird in Bytecode &uuml;bersetzt.</li>
    </ul><br />

<li>Starten des Programms.
    <ul>
    <li>Der Java Interpreter sucht nach einer statischen Methode <code>main()</code>
        und beginnt sie zu starten.
        <ul>
        <li>Da die <code>main()</code> Methode statisch ist,
            kann sie gestartet werden, obwohl noch keine
            Objekte erzeugt wurden.</li>
        </ul></li>
    <li>Zur Laufzeit des Programms werden Objekte erzeugt und ihre Methoden ausgel&ouml;st.
        <ul>
        <li><span class="red">Das Programm verrichtet seine Arbeit, indem es Objekte erzeugt und ihre Methoden ausl&ouml;st.</span></li>
        <li>Die genaue Reihenfolge der Objekterzeugung und der Methodenausl&ouml;sung h&auml;ngt von der auszuf&uuml;hrenden Aufgabe und den Input-Daten ab.</li>
        </ul></li>
    </ul>
</ol>


<A NAME="run time"></A>
<p>
Die Phase, in der das kompilierte Programm l&auml;uft, wird Laufzeit (<em>Runtime</em>) genannt. Ihr Programm ist wie das Drehbuch eines St&uuml;ckes. Das Werk, das Sie in Ihrem Programm (oder St&uuml;ck) beschreiben, wird ausgef&uuml;hrt, nachdem Sie die Beschreibung beendet haben, und es wird in die H&auml;nde der CPU (Schauspieler) gelegt.
Zur Laufzeit passieren die Dinge. Ihr sch&ouml;nes Programm (oder St&uuml;ck) wird lebendig. Daten werden eingelesen, Berechnungen werden durchgef&uuml;hrt, Dateien werden geschrieben und Schauspieler brechen sich die Beine.
</p>


</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 2:</h3>
<a href="ch30_3.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>

<p>
Programmieren ist wie das Zusammenstellen eines Teams von Mitarbeitern, um gemeinsam einen Job zu erledigen:
</p>

<ol>
<li>Zuerst planen Sie welches Personal und was f&uuml;r Material Sie brauchen werden.</li>
<li>Dann stellen Sie Personal und Material zusammen.</li>
<li>Danach arbeitet das Team mit dem Material bis der Job erledigt ist.</li>
</ol>

<p>
(Denkfrage:)
Sie haben sich entschlossen einen Pizzalieferservice zu er&ouml;ffnen,
der aus Ihnen selbst und mehreren Angestellten besteht.
Welche Stellenbeschreibungen werden diese Angestellten haben?
</p>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#30">Inhaltsverzeichnis</a>
</div>

</body>
</html>
