<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd" >
<html>
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="author" content="kjell at ieee dot org">
<meta name="copyright" content="2008">
<meta name="germantranslation" content="Heinrich Gailer, heinrich at gailer-net dot de">
<meta name="germancopyright" content="2010, Heinrich Gailer">
<meta name="robots" content="index,follow">
<title>Portabilit&auml;t</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css">
</head>

<body>
<!-- generated by CSSmaker.java, version 04/06/2010 on Tue Sep 11 15:10:17 CEST 2012 -->

<!-- ANSWER DIVISION -->

<div class="answer">
     <div class="topnavigation">
     <a href="ch04_10.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#04"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch04_12.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
<h3>Antwort:</h3>
<p>
Jede Kopie des Quellprogramms muss in eine ausf&uuml;hrbare Datei &uuml;bersetzt werden, die die richtige f&uuml;r jede Maschine ist:
</p>

<ul>
<li><b>Beim Pentium:</b> wird ein C-Compiler f&uuml;r Pentium Prozessoren verwendet.</li>
<li><b>Beim Macintosh:</b> wird ein C-Compiler f&uuml;r Macintosh Prozessoren verwendet.</li>
</ul>

</div>

<!-- LESSON DIVISION -->
<div class="lesson">
<h1>Portabilit&auml;t</h1>
<a name="portability"></a>
<div class="left"><p>
Idealerweise muss nur ein Programm in einer h&ouml;heren Sprache geschrieben werden.
Diese Quelldatei kann dann in verschiedene ausf&uuml;hrbare Dateien &uuml;bersetzt werden,
von denen jede die richtigen Maschinenbefehle f&uuml;r den  jeweiligen Prozessor enth&auml;lt.
Auf diese Weise wurden die zwei Versionen von MYST f&uuml;r den Pentium Computer und Apple Computer erstellt:
eine Quelldatei wurde erstellt und in zwei verschiedene ausf&uuml;hrbare Dateien &uuml;bersetzt.
</p>

<p>
Die Idee der Verwendung einer
Quelldatei f&uuml;r mehrere ausf&uuml;hrbare Dateien, die in verschiedenen Prozessoren laufen, ist Teil der <b>Software-Portabilit&auml;t</b>.
Sie w&uuml;rden lieber ein Programm nur einmal schreiben (in einer h&ouml;heren Sprache)
und in der Lage sein es auf jedem Computersystem laufen zu lassen, indem Sie es
in die Maschinensprache dieses Systems &uuml;bersetzten.
</p></div>


<div class="right"><p>
Gew&ouml;hnlich funktionieren die Dinge leider nicht so einfach.
Es gibt genug kleine Probleme, so dass
ein betr&auml;chtlicher menschlicher Arbeitsaufwand n&ouml;tig
ist, um ein Programm auf einem anderen System zum Laufen zu bringen.
</p>

<p>
Einer der gro&szlig;en Vorteile von Java ist, dass
es automatisch zwischen Computersystemen, die Java Unterst&uuml;tzung haben, portabel ist.
Es bedarf &uuml;berhaupt keiner menschlichen Leistung.
</p>
</div>


        <div class="clearfloats">  <!-- divs need something inside of them --> </div>
</div> <!-- end lesson -->

<!-- QUESTION DIVISION -->
<div class="question">
<h3> FRAGE 11:</h3>
<p>
Angenommen, dass ein Unternehmen Programmierern $50 pro Stunde zahlt, um Applikationsprogramme zu schreiben, die sowohl auf Apple als auch auf Intel Computern laufen. Wird das Unternehmen wollen, dass Programmierer in Java programmieren oder in einer anderen h&ouml;heren Sprache?
</p>

     <div class="navigation">
     <a href="ch04_10.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#04"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch04_12.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
</div>

</body>
</html>
