<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd" >
<html>
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="author" content="kjell at ieee dot org">
<meta name="copyright" content="2008">
<meta name="germantranslation" content="Heinrich Gailer, heinrich at gailer-net dot de">
<meta name="germancopyright" content="2010, Heinrich Gailer">
<meta name="robots" content="index,follow">
<title>Interpreter</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css">
</head>

<body>
<!-- generated by CSSmaker.java, version 04/06/2010 on Tue Sep 11 15:10:17 CEST 2012 -->

<!-- ANSWER DIVISION -->

<div class="answer">
     <div class="topnavigation">
     <a href="ch04_11.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#04"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch04_13.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
<h3>Antwort:</h3>
<p>
Java.  Die ganze Zeit (und die Kosten), um das Programm auf anderen
Computern zum Laufen zu bringen wird gespart.
(Tats&auml;chlich ist die Angelegenheit nicht ganz so eindeutig.)
</p>

</div>

<!-- LESSON DIVISION -->
<div class="lesson">
<h1>Interpreter</h1>
<a name="interpreter"></a>

<div><center>
<img src="Figure4-2.gif">
</center></div>

<div class="left">
<p>
Programme, die in einer h&ouml;heren Sprache geschrieben sind, werden niemals direkt durch
den Prozessor ausgef&uuml;hrt.
Sie haben schon eine M&ouml;glichkeit gesehen so ein Programm auszuf&uuml;hren:
die Verwendung eines &Uuml;bersetzers, um ein Maschinensprachprogramm zu erzeugen, das
direkt ausgef&uuml;hrt werden kann.
</p>

<p>
Eine andere M&ouml;glichkeit ist die Verwendung eines <b>Interpreters</b> f&uuml;r die Sprache.
Ein Interpreter ist ein ausf&uuml;hrbares Programm, das direkt auf dem Prozessor l&auml;uft.
Ein Interpreter liest ein Quellprogramm, das in einer h&ouml;heren Sprache geschrieben wurde
und f&uuml;hrt die Aktionen durch, die das Quellprogramm verlangt.
</p>

<p>
Das ist eine ziemlich komplizierte &Uuml;berlegung.
Die Abbildung hilft vielleicht:
</p>

<p>
In der Abbildung, das Quellprogramm program.bas wurde in BASIC (eine Programmiersprache) von einem Programmierer mit einem Texteditor geschrieben. Das Programm wird vom BASIC Interpreter interpretiert, der ein ausf&uuml;hrbares Programm ist, das auf dem Prozessor l&auml;uft.
</p>

<p>
Der Basic Interpreter arbeitet, in dem er die Befehle des BASIC Quellprogramms einen nach dem anderen liest.
Jedes Mal, wenn er einen Befehl liest, tut der Interpreter, was der Befehl verlangt. Ein BASIC Befehl k&ouml;nnte verlangen zwei Zahlen zu addieren. Das ist ausgezeichnet. Der Basic Interpreter ist ein Programm, und Programme k&ouml;nnen leicht zwei Zahlen addieren. Das BASIC Programm k&ouml;nnte dann verlangen die Summe auf den Bildschirm auszugeben. Auch das ist okay. Der BASIC Interpreter kann das leicht tun.
</p>


<p>
Der Basic Interpreter verwendet die fundamentalen Operationen des Prozessors um die verlangte Aktion des BASIC Quellprogramms  auszuf&uuml;hren. Aber das Quellprogramm wird nicht in Maschinensprache &uuml;bersetzt.
</p>
</div>

<a name="BASIC"></a>
<div class="right">
<p>
Das ist vergleichbar mit einem Koch, der nicht lesen kann, aber einen Assistenten anheuert, der lesen (aber nicht kochen) kann.

</p>

<a name="MYST"></a>
<p>
Sie haben das vermutlich viele Male getan, ohne es zu bemerken.
Es ist vollkommen pr&auml;zise (wenn auch eine ungebr&auml;uchliche Wortwahl)
zu sagen, dass z.B. das Computerspiel Solit&auml;r (oder jedes andere Computerspiel)
ein Interpreter f&uuml;r die Befehle ist,
die der Anwender mit Maus und Tastatur eingibt.

Die Befehle f&uuml;r das Spiel Solit&auml;r sind nicht die &uuml;bliche Art von Befehlen,
wie sie in einer Mehrzweck-Programmiersprache verwendet werden,
aber nichtsdestotrotz sind es Befehle.
Der Befehlssatz und die Regeln, wie sie korrekt zu verwenden sind,
bilden die Programmiersprache f&uuml;r den Solit&auml;r-Interpreter.
</p>

<p>
Indem Sie ein Computerspiel spielen, schreiben Sie ein Programm, das ein Problem l&ouml;st. (&Uuml;blicherweise besteht das Problem darin das Spiel zu beenden.) Wenn Sie jeden Schritt den Sie tun, aufzeichnen w&uuml;rden, h&auml;tten Sie ein Programm, das das Spiel, das als Interpreter handelt, ausf&uuml;hren k&ouml;nnte, um das Problem zu l&ouml;sen.
</p>


<p>
(Nat&uuml;rlich, jedes Mal, wenn Sie Solit&auml;r spielen ist das Problem ein zuf&auml;llig ausgew&auml;hlte Anordnung von Karten, so dass Sie f&uuml;r jedes Problem ein anderes Programm brauchen.)
</p>

</div>


        <div class="clearfloats">  <!-- divs need something inside of them --> </div>
</div> <!-- end lesson -->

<!-- QUESTION DIVISION -->
<div class="question">
<h3> FRAGE 12:</h3>
<p>
Ein Interpreter l&auml;uft direkt im Prozessor.
Aus welcher Art von Befehlen muss ein Interpreter bestehen?
</p>

     <div class="navigation">
     <a href="ch04_11.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#04"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch04_13.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
</div>

</body>
</html>
