<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2002,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Programm&uuml;bersetzung</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap04.frames on Wed Aug 20 16:09:07 CEST 2008 -->

<!-- ANSWER AREA -->

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
Im Quellprogramm, wo die &Auml;nderung leicht vorgenommen werden kann.
Das ge&auml;nderte Quellprogramm wird dann in ein neues ausf&uuml;hrbares Programm &uuml;bersetzt.
</p>

</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Programm&uuml;bersetzung</h1>
<p>
Hier ist eine Abbildung, die zeigt was &uuml;blicherweise mit Programmen passiert, die in &quot;C&quot; geschrieben sind
(mit Java ist es anders; das wird in den n&auml;chsten Kapiteln besprochen werden).

</p>

<center>
<img src="Figure4-1.gif" />
</center>

<p>
Hier ist ein &Uuml;berblick was vor sich geht:
</p>

<ol>
<li>Die Quelldatei wird mit einem Texteditor erstellt.
    <ul>
    <li>Sie enth&auml;lt Instruktionen in einer h&ouml;heren Sprache.</li>
    <li>Sie enth&auml;lt Bytes, die <em>Character</em>-Daten repr&auml;sentieren.</li>
    </ul></li>
<li>Die Quelldatei wird auf der Festplatte aufbewahrt.</li>
<li>Die Quelldatei kann nicht vom Prozessor ausgef&uuml;hrt werden.</li>
<li>Ein &Uuml;bersetzungsprogramm (Compiler) kann die Quelldatei in eine ausf&uuml;hrbare Datei &uuml;bersetzen.
    <ul>
    <li>Die Quelldatei bleibt unver&auml;ndert; eine neue ausf&uuml;hrbare Datei wurde erzeugt.</li>
    <li>Ein &Uuml;bersetzer wird f&uuml;r Programme verwendet, die
        in einer bestimmten h&ouml;heren Sprache (wie C) geschrieben wurden,
        f&uuml;r einen bestimmten Prozessortyp (wie Pentium) bestimmt sind
        und nur unter einem bestimmten Betriebssystem (wie Windows) laufen.</li>
    </ul></li>
<li>Die ausf&uuml;hrbare Datei wird auf der Festplatte aufbewahrt.
<li>Um das Programm auszuf&uuml;hren, wird dem Betriebssystem mitgeteilt
    die ausf&uuml;hrbare Datei in den Hauptspeicher zu kopieren und sie zu starten.</li>
</ol>


<p>
Das oben stehende gilt f&uuml;r die meisten Sprachen wie:
Ada, Pascal, C, C++, FORTRAN und andere.
Java f&uuml;gt ein paar mehr Schritte hinzu,
die in dem n&auml;chsten Kapitel behandelt werden.
</p>

</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 10:</h3>
<a href="ch04_11.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
Ein Quellprogramm wurde in der Sprache C geschrieben.
Die Datei wurde auf die Festplatte eines Pentium-basierten Computers und
auf die Festplatte eines Apple Macintosh kopiert.
Was muss jetzt getan werden, damit das Programm auf beiden Computern ausgef&uuml;hrt werden kann?
</p>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#04">Inhaltsverzeichnis</a>
</div>

</body>
</html>
