<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2002,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Quellprogramme</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap04.frames on Wed Aug 20 16:09:07 CEST 2008 -->

<!-- ANSWER AREA -->

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
In einer h&ouml;heren Sprache.
Programmierer k&ouml;nnen Programme durch die Verwendung einer h&ouml;heren Sprache
in wesentlich k&uuml;rzerer Zeit (was wesentlich weniger Geld kostet) erstellen.
</p>

</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Quellprogramme</h1>
<A NAME="source program"></A>
<A NAME="program, source"></A>

<p>
Programmierer erstellen Programme, indem sie Befehle in einer h&ouml;heren Sprache schreiben.
Ein h&ouml;heres Sprachprogramm besteht aus Textzeilen,
die mit einem Texteditor erstellt werden und als Datei auf der Festplatte bereitgehalten werden.
Zum Beispiel,
hier ist ein vollst&auml;ndiges Programm in "C" (Java wird sp&auml;ter besprochen):
</p>


<pre class="code">
#include &lt;stdio.h&gt;
main()
{
  int sum = 0;
  sum = 2 + 2;
  printf( "%d\n", sum );
}
</pre>


<p>
Dieses Programm k&ouml;nnte auf der Festplatte in einer Datei mit dem Namen
<code>addup.c</code> gespeichert werden.
Wie alle Dateien besteht es aus einer Sequenz von Bytes.
Da es eine Textdatei ist, enthalten diese Bytes <em>Character</em>-Daten.
Sie k&ouml;nnen die Datei mit einem Texteditor editieren und die Datei ausdrucken.
Sie enth&auml;lt <em>keine</em> Maschinenbefehle.
Wenn die Bytes in den Hauptspeicher kopiert werden, k&ouml;nnen Sie nicht ohne etwas
Zusatzarbeit als Programm laufen.
</p>

<blockquote>
Ein <strong>Quellprogramm</strong> ist eine Textdatei,
die Befehle enth&auml;lt, die in einer h&ouml;heren Sprache geschrieben wurden.
Sie kann vom Prozessor nicht ohne Zwischenschritte ausgef&uuml;hrt werden.
</blockquote>


<A NAME="program translation"></A>
<p>
Ein Quellprogramm wird &uuml;blicherweise in ein Maschinensprachprogramm <strong>&uuml;bersetzt</strong>.
Ein Applikationsprogramm, <b>&Uuml;bersetzer</b> genannt, nimmt die Quelldatei als Input
und erstellt ein ausf&uuml;hrbares Programm (Maschinensprachprogramm) als Output.
Zum Beispiel k&ouml;nnte das
"C" Programm <code>addup.c</code> in ein ausf&uuml;hrbares Programm &uuml;bersetzt werden.
Das ausf&uuml;hrbare Programm k&ouml;nnte <code>addup.exe</code> genannt werden und auf der
Festplatte gespeichert werden.
Jetzt kann die ausf&uuml;hrbare Version des Programms in den Hauptspeicher kopiert und ausgef&uuml;hrt werden.
</p>

<A NAME="compile"></A>
<p>
Das Wort <b>kompilieren</b> bedeutet das gleiche wie <b>&uuml;bersetzen</b>.
Also kann man sagen, dass ein Quellprogramm in ein ausf&uuml;hrbares Programm kompiliert wurde.
</p>

</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 9:</h3>
<a href="ch04_10.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
Angenommen ein Quellprogramm wurde in ein ausf&uuml;hrbares Programm &uuml;bersetzt.
Das ausf&uuml;hrbare Programm ist ein paar Mal gelaufen
und der Programmierer beschlie&szlig;t das Programm zu &auml;ndern.
Wo wird die &Auml;nderung vorgenommen? Im Quellprogramm oder im ausf&uuml;hrbaren Programm?
</p>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#04">Inhaltsverzeichnis</a>
</div>

</body>
</html>
