<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2000,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Variablen</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap09A.frames on Tue Jun 10 14:13:11 CEST 2008 -->

<!-- ANSWER AREA -->
<p>
Glauben Sie, dass eine <em>Variable</em> ihren Wert &auml;ndern kann?
</p>


<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
Ja &#8212; das ist vielleicht der Grund, warum sie Variable genannt wird.
</p>


</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Variablen</h1>

<A NAME="Neumann, John von"></A>
<p>
Die Millionen Bytes des Hauptspeichers in Ihrem Computer werden verwendet, um
sowohl Maschinenbefehle als auch Daten zu speichern.
Die elektronischen Schaltungen des Hauptspeichers (und aller anderen Arten von Speicher)
machen keinen Unterschied zwischen diesen beiden.
Wenn ein Programm l&auml;uft, werden einige Speicherstellen f&uuml;r
Maschinenbefehle und andere f&uuml;r Daten verwendet.
Sp&auml;ter, wenn ein anderes Programm l&auml;uft,
werden einige Bytes, die vorher Maschinenbefehle enthielten,
jetzt Daten enthalten und einige, die vorher Daten enthielten,
werden jetzt Maschinenbefehle enthalten.
Die Verwendung des gleichen Speichers sowohl f&uuml;r Befehle als
auch f&uuml;r Daten war die Idee von
<nobr>John von Neumann,</nobr>
ein fr&uuml;herer Computerpionier
(<b>Hinweis:</b> selbst wenn es nur ein bisschen unklar ist, was Bytes
und Speicherstellen sind, lesen Sie bitte <a href="../chap03/ch03_1.html">Kapitel 3</a> durch.)
</p>

<A NAME="variable, definition of"></A>
<p>
Um Daten in den Speicher zu stellen und sie sp&auml;ter zur&uuml;ckzubekommen,
muss ein Programm f&uuml;r jeden Speicherabschnitt, den es verwendet, einen Namen haben.
</p>

<blockquote>
<b>Variable</b> &#8212; ein Name f&uuml;r eine Speicherstelle im Hauptspeicher,
die einen bestimmten Datentyp verwendet, um einen Wert zu halten.
</blockquote>

<p>
Erinnern Sie sich daran, dass ein Datentyp ein Schema f&uuml;r die Verwendung
von Bitmustern im Hauptspeicher ist, um Daten darzustellen.
(Diese Definition von Variablen ist &uuml;brigens nicht allzu gut.
Sie wird sp&auml;ter ge&auml;ndert werden m&uuml;ssen, wenn Sie mehr dar&uuml;ber lernen was
&quot;wirklich vor sich geht&quot;.)
</p>

<p>
Sie k&ouml;nnen sich eine Variable als einen kleinen Beh&auml;lter vorstellen, der aus einem oder mehreren Bytes besteht, die einen Wert eines bestimmten Datentyps enthalten k&ouml;nnen:
</p>

<blockquote><pre>
<img src="payAmount.gif" align="middle" />
lohnbetrag;
Typ ist "long"
</pre></blockquote>

<p>
Variablen haben Namen wie <code>lohnbetrag</code>.
</p>



</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 2:</h3>
<a href="ch09A_3.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<p>
&Auml;ndert sich jemals die Anzahl der Bits, die f&uuml;r eine primitive Variable verwendet wird?
</p>

</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#09A">Inhaltsverzeichnis</a>
</div>

</body>
</html>
