<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN">
<html>
<head>
<meta name="copyright" content="2002,  Bradley Kjell" />
<meta name="author" content="Bradley Kjell kjell@ieee.org " />
<meta name="translation" content="Copyright 2003 - 2006 Deutsche &Uuml;bersetzung Heinrich Gailer heinrich@gailer-net.de" />
<meta name="robots" content="index,follow" />
<title>Charakteristische Merkmale von Objekten</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css" />
</head>

<body>
<!-- generated by CSSmaker.java, version of 10/12/2004-->
<!-- from source javaChap25.frames on Fri Sep 17 09:18:36 CEST 2010 -->

<!-- ANSWER AREA -->
<p>
Was ist ein Objekt?
</p>

<div class="answer">
<h3>Eine gute Antwort w&auml;re:</h3>
<p>
Hier ist meine inoffizielle Liste:
</p>

<ul>
<li>Ein Objekt besteht aus f&uuml;hlbarem Material (der Stift ist aus Plastik, Metal, Tinte).
</li>
<li>Ein Objekt h&auml;lt ein einziges Ganzes zusammen (der ganze Stift, nicht ein Nebel.)</li>
<li>Ein Objekt hat Eigenschaften (die Farbe des Stifts, wo er sich befindet, wie dick er schreibt...).</li>
<li>Ein Objekt kann Dinge tun und Dinge k&ouml;nnen etwas mit ihm tun.</li>
</ul>


</div>

<!-- LESSON AREA -->
<div class="lesson">
<h1>Charakteristische Merkmale von Objekten</h1>
<p>
Der erste Punkt in der Liste ist zu restriktiv.
Sie k&ouml;nnen sich z. B. Ihr Bankkonto als ein Objekt vorstellen, aber es besteht aus keinem Material
(obwohl Sie und die Bank Material benutzen m&ouml;gen, um Ihre Kontobewegungen aufzuzeichnen, existiert das Konto unabh&auml;ngig von diesem Material).
Obwohl es nicht materiell ist, besitzt Ihr Konto Eigenschaften (Kontostand, Zinssatz, Besitzer), Sie k&ouml;nnen Dinge mit ihm tun (Geld einzahlen, &Uuml;berweisungen stornieren) und, es kann Dinge tun (Buchungen belasten, Zinsen gutschreiben).
</p>


<A NAME="object, characteristics"></A>
<p>
Die letzten drei Punkte auf der Liste scheinen klar genug zu sein.
Sie haben in der Tat Namen:
</p>

<ul>
<li>Ein Objekt besitzt eine <strong>Identit&auml;t</strong> (es ist ein einzelnes Ganzes).</li>
<li>Ein Objekt besitzt einen <strong>Zustand</strong> (es besitzt verschiedene Eigenschaften, die sich &auml;ndern k&ouml;nnen).</li>
<li>Ein Objekt besitzt ein <strong>Verhalten</strong> (es kann Dinge tun und Dinge k&ouml;nnen etwas mit ihm tun).</li>
</ul>

<p>
Das ist eine etwas umgangssprachliche Beschreibung von dem, was ein Objekt ist.
Seien Sie nicht &uuml;berrascht, wenn Sie in anderen Aufzeichnungen oder B&uuml;chern eine andere Liste sehen.
Wenn Sie damit beginnen objektorientierte Software zu schreiben werden Sie herausfinden, dass es schwierig ist exakt festzustellen, welches Ihre Objekte sind.
</p>


</div>

<!-- QUESTION AREA -->
<div class="question">
<h3> FRAGE 3:</h3>
<a href="ch25_4.html">
<img src="../nextBut.gif" hspace="5" align="right" border="0"/></a>
<img src="tennis.gif" align="left" hspace="10" vspace="10" />
<p>
Betrachten Sie eine R&ouml;hre mit vier Tennisb&auml;llen.
</p>

<ul>
<li>Ist die R&ouml;hre mit den Tennisb&auml;llen ein Objekt?</li>
<li>Ist jeder Tennisball ein Objekt?</li>
<li>K&ouml;nnen die beiden oberen B&auml;lle als ein einzelnes Objekt betrachtet werden?</li>
<li>Ist die Farbe der B&auml;lle ein Objekt?</li>
<li>Ist Ihr Verst&auml;ndnis von Tennisb&auml;llen ein Objekt?</li>
</ul>

<br clear="all" />


</div>
<div>
<a title="Zurück zum Inhaltsverzeichnis gehen." href="../../java-toc.html#25">Inhaltsverzeichnis</a>
</div>

</body>
</html>
