<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd" >
<html>
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=iso-8859-1">
<meta name="author" content="kjell at ieee dot org">
<meta name="copyright" content="2008">
<meta name="germantranslation" content="Heinrich Gailer, heinrich at gailer-net dot de">
<meta name="germancopyright" content="2010, Heinrich Gailer">
<meta name="robots" content="index,follow">
<title>Dateien und das Betriebssystem</title>
<link rel="stylesheet" type="text/css" href="../CAIstyle.css">
</head>

<body>
<!-- generated by CSSmaker.java, version 04/06/2010 on Tue Mar 20 15:21:12 CET 2012 -->

<!-- ANSWER DIVISION -->

<div class="answer">
     <div class="topnavigation">
     <a href="ch03_12.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#03"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch03_14.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
<h3>Antwort:</h3>
<p>
&Uuml;blicherweise in eine Datei auf dem Sekund&auml;rspeicher. Wenn die Datei noch nicht existiert,
wird das Programm das Betriebssystem veranlassen sie zu erzeugen.
</p>

</div>

<!-- LESSON DIVISION -->
<div class="lesson">
<h1>Dateien und das Betriebssystem</h1>
<p>
Gew&ouml;hnlich sind alle Sammlungen von Daten au&szlig;erhalb des Hauptspeichers
in Dateien organisiert.
Es ist die Aufgabe des Betriebssystems &uuml;ber all diese Information den &Uuml;berblick zu behalten.
Wenn das Computersystem Teil eines Netzwerks ist, kann die Aufgabe, den &Uuml;berblick &uuml;ber alle
Dateien auf allen Computern zu behalten, eine ganz sch&ouml;ne Aufgabe sein,
und ist die gemeinsame Aufgabe aller beteiligten Betriebssysteme.
</p>

<p>
Applikationsprogramme (einschlie&szlig;lich der Programme, die Sie schreiben k&ouml;nnten)
k&ouml;nnen nicht direkt Dateien lesen, schreiben, erzeugen oder l&ouml;schen.
Da das Betriebssystem alles verfolgen muss, fordert es alle anderen Programme auf, die Handhabung von Dateiaufgaben zu &uuml;bernehmen.
Zum Beispiel angenommen , dass ein Programm gerade eine Reihe von Zahlen berechnet hat
und sie speichern muss.
Es k&ouml;nnte das Folgende tun:
</p>

<ol>
<li><b>Das Programm:</b> fordert das Betriebssystem auf eine Datei mit dem Namen <em>ERGEBNIS.DAT</em> zu erzeugen.</li>
<li><b>Das Betriebssystem:</b> bekommt die Anforderung; findet einen unbenutzten Abschnitt auf der Platte und erzeugt eine leere Datei. Dem Programm wird mitgeteilt, wenn das erledigt ist.</li>
<li><b>Das Programm:</b> fordert das Betriebssystem auf die Zahlen in der Datei zu speichern.</li>
<li><b>Das Betriebssystem:</b> bekommt die Zahlen aus dem Hauptspeicherbereich des Programms und schreibt sie in die Datei. Das Programm bekommt die R&uuml;ckmeldung, wenn das geschehen ist.</li>
<li><b>Das Programm:</b> setzt seine Arbeit - mit was auch immer - fort.</li>
</ol>

<p>
Daher, wenn ein Applikationsprogramm l&auml;uft,
verlangt es st&auml;ndig vom Betriebssystem die Durchf&uuml;hrung von Dateiaufgaben
(und andere Aufgaben) und wartet darauf, dass sie abgeschlossen werden.
Wenn ein Programm vom Betriebssystem etwas zu tun verlangt, was das
Dateisystem besch&auml;digt, wird das Betriebssystem sich weigern es zu tun.
Moderne Programme sind so geschrieben, dass sie Alternativen haben, wenn eine Anforderung
verweigert wird.
&Auml;ltere Programme wurden nicht in dieser Art geschrieben und laufen nicht allzu gut auf modernen Computern.
</p>

        <div class="clearfloats">  <!-- divs need something inside of them --> </div>
</div> <!-- end lesson -->

<!-- QUESTION DIVISION -->
<div class="question">
<h3> FRAGE 13:</h3>
<p>
Bei modernen Computersystemen kann nur das Betriebssystem direkt alles mit
Dateien auf der Festplatte tun.
Welche Auswirkungen hat dies auf:
</p>

<ol>
<li>die Sicherheit des Systems? </li>
<li>Computerspiele?</li>
<li>den Komfort bei der Erstellung von Programmen?</li>
</ol>

<p>
(Sie sind sich vielleicht &uuml;ber Ihre Antworten nicht sicher,
aber denken Sie bitte &uuml;ber die Fragen nach.)
</p>

     <div class="navigation">
     <a href="ch03_12.html"><img src="../backIcon.gif" alt="zur vorherigen Seite"></a> &nbsp; 
     <a href="../../index.html#03"><img src="../homeIcon.gif" alt="zum Inhaltsverzeichnis"></a> &nbsp;
     <a href="ch03_14.html"><img src="../nextIcon.gif" alt="zur n&auml;chsten Seite"></a>
     </div>
</div>

</body>
</html>
